grevaillot/svd_tools/headers/STM32G474xx/hrtim_timb.h
#pragma once 

/* --- HRTIM_TIMB: High Resolution Timer: TIMB ---------------------- */

/** @defgroup hrtim_timb_registers High Resolution Timer: TIMB Register
@{*/

/** HRTIM_TIMB_TIMBCR Timerx Control Register **/
#define HRTIM_TIMB_TIMBCR			MMIO32(HRTIM_TIMB_BASE + 0x00)
/** HRTIM_TIMB_TIMBISR Timerx Interrupt Status Register **/
#define HRTIM_TIMB_TIMBISR			MMIO32(HRTIM_TIMB_BASE + 0x04)
/** HRTIM_TIMB_TIMBICR Timerx Interrupt Clear Register **/
#define HRTIM_TIMB_TIMBICR			MMIO32(HRTIM_TIMB_BASE + 0x08)
/** HRTIM_TIMB_TIMBDIER TIMxDIER **/
#define HRTIM_TIMB_TIMBDIER			MMIO32(HRTIM_TIMB_BASE + 0x0c)
/** HRTIM_TIMB_CNTR Timerx Counter Register **/
#define HRTIM_TIMB_CNTR			MMIO32(HRTIM_TIMB_BASE + 0x10)
/** HRTIM_TIMB_PERBR Timerx Period Register **/
#define HRTIM_TIMB_PERBR			MMIO32(HRTIM_TIMB_BASE + 0x14)
/** HRTIM_TIMB_REPBR Timerx Repetition Register **/
#define HRTIM_TIMB_REPBR			MMIO32(HRTIM_TIMB_BASE + 0x18)
/** HRTIM_TIMB_CMP1BR Timerx Compare 1 Register **/
#define HRTIM_TIMB_CMP1BR			MMIO32(HRTIM_TIMB_BASE + 0x1c)
/** HRTIM_TIMB_CMP1CBR Timerx Compare 1 Compound Register **/
#define HRTIM_TIMB_CMP1CBR			MMIO32(HRTIM_TIMB_BASE + 0x20)
/** HRTIM_TIMB_CMP2BR Timerx Compare 2 Register **/
#define HRTIM_TIMB_CMP2BR			MMIO32(HRTIM_TIMB_BASE + 0x24)
/** HRTIM_TIMB_CMP3BR Timerx Compare 3 Register **/
#define HRTIM_TIMB_CMP3BR			MMIO32(HRTIM_TIMB_BASE + 0x28)
/** HRTIM_TIMB_CMP4BR Timerx Compare 4 Register **/
#define HRTIM_TIMB_CMP4BR			MMIO32(HRTIM_TIMB_BASE + 0x2c)
/** HRTIM_TIMB_CPT1BR Timerx Capture 1 Register **/
#define HRTIM_TIMB_CPT1BR			MMIO32(HRTIM_TIMB_BASE + 0x30)
/** HRTIM_TIMB_CPT2BR Timerx Capture 2 Register **/
#define HRTIM_TIMB_CPT2BR			MMIO32(HRTIM_TIMB_BASE + 0x34)
/** HRTIM_TIMB_DTBR Timerx Deadtime Register **/
#define HRTIM_TIMB_DTBR			MMIO32(HRTIM_TIMB_BASE + 0x38)
/** HRTIM_TIMB_SETB1R Timerx Output1 Set Register **/
#define HRTIM_TIMB_SETB1R			MMIO32(HRTIM_TIMB_BASE + 0x3c)
/** HRTIM_TIMB_RSTB1R Timerx Output1 Reset Register **/
#define HRTIM_TIMB_RSTB1R			MMIO32(HRTIM_TIMB_BASE + 0x40)
/** HRTIM_TIMB_SETB2R Timerx Output2 Set Register **/
#define HRTIM_TIMB_SETB2R			MMIO32(HRTIM_TIMB_BASE + 0x44)
/** HRTIM_TIMB_RSTB2R Timerx Output2 Reset Register **/
#define HRTIM_TIMB_RSTB2R			MMIO32(HRTIM_TIMB_BASE + 0x48)
/** HRTIM_TIMB_EEFBR1 Timerx External Event Filtering Register 1 **/
#define HRTIM_TIMB_EEFBR1			MMIO32(HRTIM_TIMB_BASE + 0x4c)
/** HRTIM_TIMB_EEFBR2 Timerx External Event Filtering Register 2 **/
#define HRTIM_TIMB_EEFBR2			MMIO32(HRTIM_TIMB_BASE + 0x50)
/** HRTIM_TIMB_RSTBR TimerA Reset Register **/
#define HRTIM_TIMB_RSTBR			MMIO32(HRTIM_TIMB_BASE + 0x54)
/** HRTIM_TIMB_CHPBR Timerx Chopper Register **/
#define HRTIM_TIMB_CHPBR			MMIO32(HRTIM_TIMB_BASE + 0x58)
/** HRTIM_TIMB_CPT1BCR Timerx Capture 2 Control Register **/
#define HRTIM_TIMB_CPT1BCR			MMIO32(HRTIM_TIMB_BASE + 0x5c)
/** HRTIM_TIMB_CPT2BCR CPT2xCR **/
#define HRTIM_TIMB_CPT2BCR			MMIO32(HRTIM_TIMB_BASE + 0x60)
/** HRTIM_TIMB_OUTBR Timerx Output Register **/
#define HRTIM_TIMB_OUTBR			MMIO32(HRTIM_TIMB_BASE + 0x64)
/** HRTIM_TIMB_FLTBR Timerx Fault Register **/
#define HRTIM_TIMB_FLTBR			MMIO32(HRTIM_TIMB_BASE + 0x68)
/** HRTIM_TIMB_TIMBCR2 HRTIM Timerx Control Register 2 **/
#define HRTIM_TIMB_TIMBCR2			MMIO32(HRTIM_TIMB_BASE + 0x6c)
/** HRTIM_TIMB_BEEFR3 HRTIM Timerx External Event Filtering Register 3 **/
#define HRTIM_TIMB_BEEFR3			MMIO32(HRTIM_TIMB_BASE + 0x70)

/**@}*/


/** @defgroup hrtim_timb_timbcr TIMBCR Timerx Control Register
@{*/


#define HRTIM_TIMB_TIMBCR_UPDGAT_SHIFT		28
#define HRTIM_TIMB_TIMBCR_UPDGAT_MASK		0x0f
/** @defgroup hrtim_timb_timbcr_updgat UPDGAT Update Gating
@{*/
/**@}*/

/** HRTIM_TIMB_TIMBCR_PREEN Preload enable **/
#define HRTIM_TIMB_TIMBCR_PREEN		(1 << 27)

#define HRTIM_TIMB_TIMBCR_DACSYNC_SHIFT		25
#define HRTIM_TIMB_TIMBCR_DACSYNC_MASK		0x03
/** @defgroup hrtim_timb_timbcr_dacsync DACSYNC AC Synchronization
@{*/
/**@}*/

/** HRTIM_TIMB_TIMBCR_MSTU Master Timer update **/
#define HRTIM_TIMB_TIMBCR_MSTU		(1 << 24)
/** HRTIM_TIMB_TIMBCR_TEU TEU **/
#define HRTIM_TIMB_TIMBCR_TEU		(1 << 23)
/** HRTIM_TIMB_TIMBCR_TDU TDU **/
#define HRTIM_TIMB_TIMBCR_TDU		(1 << 22)
/** HRTIM_TIMB_TIMBCR_TCU TCU **/
#define HRTIM_TIMB_TIMBCR_TCU		(1 << 21)
/** HRTIM_TIMB_TIMBCR_TAU TAU **/
#define HRTIM_TIMB_TIMBCR_TAU		(1 << 19)
/** HRTIM_TIMB_TIMBCR_TxRSTU Timerx reset update **/
#define HRTIM_TIMB_TIMBCR_TxRSTU		(1 << 18)
/** HRTIM_TIMB_TIMBCR_TxREPU Timer x Repetition update **/
#define HRTIM_TIMB_TIMBCR_TxREPU		(1 << 17)
/** HRTIM_TIMB_TIMBCR_TFU TFU **/
#define HRTIM_TIMB_TIMBCR_TFU		(1 << 16)

#define HRTIM_TIMB_TIMBCR_DELCMP4_SHIFT		14
#define HRTIM_TIMB_TIMBCR_DELCMP4_MASK		0x03
/** @defgroup hrtim_timb_timbcr_delcmp4 DELCMP4 Delayed CMP4 mode
@{*/
/**@}*/


#define HRTIM_TIMB_TIMBCR_DELCMP2_SHIFT		12
#define HRTIM_TIMB_TIMBCR_DELCMP2_MASK		0x03
/** @defgroup hrtim_timb_timbcr_delcmp2 DELCMP2 Delayed CMP2 mode
@{*/
/**@}*/

/** HRTIM_TIMB_TIMBCR_SYNCSTRTx Synchronization Starts Timer x **/
#define HRTIM_TIMB_TIMBCR_SYNCSTRTx		(1 << 11)
/** HRTIM_TIMB_TIMBCR_SYNCRSTx Synchronization Resets Timer x **/
#define HRTIM_TIMB_TIMBCR_SYNCRSTx		(1 << 10)
/** HRTIM_TIMB_TIMBCR_RSYNCU Re-Synchronized Update **/
#define HRTIM_TIMB_TIMBCR_RSYNCU		(1 << 9)

#define HRTIM_TIMB_TIMBCR_INTLVD_SHIFT		7
#define HRTIM_TIMB_TIMBCR_INTLVD_MASK		0x03
/** @defgroup hrtim_timb_timbcr_intlvd INTLVD Interleaved mode
@{*/
/**@}*/

/** HRTIM_TIMB_TIMBCR_PSHPLL Push-Pull mode enable **/
#define HRTIM_TIMB_TIMBCR_PSHPLL		(1 << 6)
/** HRTIM_TIMB_TIMBCR_HALF Half mode enable **/
#define HRTIM_TIMB_TIMBCR_HALF		(1 << 5)
/** HRTIM_TIMB_TIMBCR_RETRIG Re-triggerable mode **/
#define HRTIM_TIMB_TIMBCR_RETRIG		(1 << 4)
/** HRTIM_TIMB_TIMBCR_CONT Continuous mode **/
#define HRTIM_TIMB_TIMBCR_CONT		(1 << 3)

#define HRTIM_TIMB_TIMBCR_CK_PSCx_SHIFT		0
#define HRTIM_TIMB_TIMBCR_CK_PSCx_MASK		0x07
/** @defgroup hrtim_timb_timbcr_ck_pscx CKPSCx HRTIM Timer x Clock prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_timbisr TIMBISR Timerx Interrupt Status Register
@{*/

/** HRTIM_TIMB_TIMBISR_O2CPY Output 2 Copy **/
#define HRTIM_TIMB_TIMBISR_O2CPY		(1 << 21)
/** HRTIM_TIMB_TIMBISR_O1CPY Output 1 Copy **/
#define HRTIM_TIMB_TIMBISR_O1CPY		(1 << 20)
/** HRTIM_TIMB_TIMBISR_O2STAT Output 2 State **/
#define HRTIM_TIMB_TIMBISR_O2STAT		(1 << 19)
/** HRTIM_TIMB_TIMBISR_O1STAT Output 1 State **/
#define HRTIM_TIMB_TIMBISR_O1STAT		(1 << 18)
/** HRTIM_TIMB_TIMBISR_IPPSTAT Idle Push Pull Status **/
#define HRTIM_TIMB_TIMBISR_IPPSTAT		(1 << 17)
/** HRTIM_TIMB_TIMBISR_CPPSTAT Current Push Pull Status **/
#define HRTIM_TIMB_TIMBISR_CPPSTAT		(1 << 16)
/** HRTIM_TIMB_TIMBISR_DLYPRT Delayed Protection Flag **/
#define HRTIM_TIMB_TIMBISR_DLYPRT		(1 << 14)
/** HRTIM_TIMB_TIMBISR_RST Reset Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_RST		(1 << 13)
/** HRTIM_TIMB_TIMBISR_RSTx2 Output 2 Reset Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_RSTx2		(1 << 12)
/** HRTIM_TIMB_TIMBISR_SETx2 Output 2 Set Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_SETx2		(1 << 11)
/** HRTIM_TIMB_TIMBISR_RSTx1 Output 1 Reset Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_RSTx1		(1 << 10)
/** HRTIM_TIMB_TIMBISR_SETx1 Output 1 Set Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_SETx1		(1 << 9)
/** HRTIM_TIMB_TIMBISR_CPT2 Capture2 Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_CPT2		(1 << 8)
/** HRTIM_TIMB_TIMBISR_CPT1 Capture1 Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_CPT1		(1 << 7)
/** HRTIM_TIMB_TIMBISR_UPD Update Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_UPD		(1 << 6)
/** HRTIM_TIMB_TIMBISR_REP Repetition Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_REP		(1 << 4)
/** HRTIM_TIMB_TIMBISR_CMP4 Compare 4 Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_CMP4		(1 << 3)
/** HRTIM_TIMB_TIMBISR_CMP3 Compare 3 Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_CMP3		(1 << 2)
/** HRTIM_TIMB_TIMBISR_CMP2 Compare 2 Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_CMP2		(1 << 1)
/** HRTIM_TIMB_TIMBISR_CMP1 Compare 1 Interrupt Flag **/
#define HRTIM_TIMB_TIMBISR_CMP1		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_timbicr TIMBICR Timerx Interrupt Clear Register
@{*/

/** HRTIM_TIMB_TIMBICR_DLYPRTC Delayed Protection Flag Clear **/
#define HRTIM_TIMB_TIMBICR_DLYPRTC		(1 << 14)
/** HRTIM_TIMB_TIMBICR_RSTC Reset Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_RSTC		(1 << 13)
/** HRTIM_TIMB_TIMBICR_RSTx2C Output 2 Reset flag Clear **/
#define HRTIM_TIMB_TIMBICR_RSTx2C		(1 << 12)
/** HRTIM_TIMB_TIMBICR_SET2xC Output 2 Set flag Clear **/
#define HRTIM_TIMB_TIMBICR_SET2xC		(1 << 11)
/** HRTIM_TIMB_TIMBICR_RSTx1C Output 1 Reset flag Clear **/
#define HRTIM_TIMB_TIMBICR_RSTx1C		(1 << 10)
/** HRTIM_TIMB_TIMBICR_SET1xC Output 1 Set flag Clear **/
#define HRTIM_TIMB_TIMBICR_SET1xC		(1 << 9)
/** HRTIM_TIMB_TIMBICR_CPT2C Capture2 Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_CPT2C		(1 << 8)
/** HRTIM_TIMB_TIMBICR_CPT1C Capture1 Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_CPT1C		(1 << 7)
/** HRTIM_TIMB_TIMBICR_UPDC Update Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_UPDC		(1 << 6)
/** HRTIM_TIMB_TIMBICR_REPC Repetition Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_REPC		(1 << 4)
/** HRTIM_TIMB_TIMBICR_CMP4C Compare 4 Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_CMP4C		(1 << 3)
/** HRTIM_TIMB_TIMBICR_CMP3C Compare 3 Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_CMP3C		(1 << 2)
/** HRTIM_TIMB_TIMBICR_CMP2C Compare 2 Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_CMP2C		(1 << 1)
/** HRTIM_TIMB_TIMBICR_CMP1C Compare 1 Interrupt flag Clear **/
#define HRTIM_TIMB_TIMBICR_CMP1C		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_timbdier TIMBDIER TIMxDIER
@{*/

/** HRTIM_TIMB_TIMBDIER_DLYPRTDE DLYPRTDE **/
#define HRTIM_TIMB_TIMBDIER_DLYPRTDE		(1 << 30)
/** HRTIM_TIMB_TIMBDIER_RSTDE RSTDE **/
#define HRTIM_TIMB_TIMBDIER_RSTDE		(1 << 29)
/** HRTIM_TIMB_TIMBDIER_RSTx2DE RSTx2DE **/
#define HRTIM_TIMB_TIMBDIER_RSTx2DE		(1 << 28)
/** HRTIM_TIMB_TIMBDIER_SETx2DE SETx2DE **/
#define HRTIM_TIMB_TIMBDIER_SETx2DE		(1 << 27)
/** HRTIM_TIMB_TIMBDIER_RSTx1DE RSTx1DE **/
#define HRTIM_TIMB_TIMBDIER_RSTx1DE		(1 << 26)
/** HRTIM_TIMB_TIMBDIER_SET1xDE SET1xDE **/
#define HRTIM_TIMB_TIMBDIER_SET1xDE		(1 << 25)
/** HRTIM_TIMB_TIMBDIER_CPT2DE CPT2DE **/
#define HRTIM_TIMB_TIMBDIER_CPT2DE		(1 << 24)
/** HRTIM_TIMB_TIMBDIER_CPT1DE CPT1DE **/
#define HRTIM_TIMB_TIMBDIER_CPT1DE		(1 << 23)
/** HRTIM_TIMB_TIMBDIER_UPDDE UPDDE **/
#define HRTIM_TIMB_TIMBDIER_UPDDE		(1 << 22)
/** HRTIM_TIMB_TIMBDIER_REPDE REPDE **/
#define HRTIM_TIMB_TIMBDIER_REPDE		(1 << 20)
/** HRTIM_TIMB_TIMBDIER_CMP4DE CMP4DE **/
#define HRTIM_TIMB_TIMBDIER_CMP4DE		(1 << 19)
/** HRTIM_TIMB_TIMBDIER_CMP3DE CMP3DE **/
#define HRTIM_TIMB_TIMBDIER_CMP3DE		(1 << 18)
/** HRTIM_TIMB_TIMBDIER_CMP2DE CMP2DE **/
#define HRTIM_TIMB_TIMBDIER_CMP2DE		(1 << 17)
/** HRTIM_TIMB_TIMBDIER_CMP1DE CMP1DE **/
#define HRTIM_TIMB_TIMBDIER_CMP1DE		(1 << 16)
/** HRTIM_TIMB_TIMBDIER_DLYPRTIE DLYPRTIE **/
#define HRTIM_TIMB_TIMBDIER_DLYPRTIE		(1 << 14)
/** HRTIM_TIMB_TIMBDIER_RSTIE RSTIE **/
#define HRTIM_TIMB_TIMBDIER_RSTIE		(1 << 13)
/** HRTIM_TIMB_TIMBDIER_RSTx2IE RSTx2IE **/
#define HRTIM_TIMB_TIMBDIER_RSTx2IE		(1 << 12)
/** HRTIM_TIMB_TIMBDIER_SETx2IE SETx2IE **/
#define HRTIM_TIMB_TIMBDIER_SETx2IE		(1 << 11)
/** HRTIM_TIMB_TIMBDIER_RSTx1IE RSTx1IE **/
#define HRTIM_TIMB_TIMBDIER_RSTx1IE		(1 << 10)
/** HRTIM_TIMB_TIMBDIER_SET1xIE SET1xIE **/
#define HRTIM_TIMB_TIMBDIER_SET1xIE		(1 << 9)
/** HRTIM_TIMB_TIMBDIER_CPT2IE CPT2IE **/
#define HRTIM_TIMB_TIMBDIER_CPT2IE		(1 << 8)
/** HRTIM_TIMB_TIMBDIER_CPT1IE CPT1IE **/
#define HRTIM_TIMB_TIMBDIER_CPT1IE		(1 << 7)
/** HRTIM_TIMB_TIMBDIER_UPDIE UPDIE **/
#define HRTIM_TIMB_TIMBDIER_UPDIE		(1 << 6)
/** HRTIM_TIMB_TIMBDIER_REPIE REPIE **/
#define HRTIM_TIMB_TIMBDIER_REPIE		(1 << 4)
/** HRTIM_TIMB_TIMBDIER_CMP4IE CMP4IE **/
#define HRTIM_TIMB_TIMBDIER_CMP4IE		(1 << 3)
/** HRTIM_TIMB_TIMBDIER_CMP3IE CMP3IE **/
#define HRTIM_TIMB_TIMBDIER_CMP3IE		(1 << 2)
/** HRTIM_TIMB_TIMBDIER_CMP2IE CMP2IE **/
#define HRTIM_TIMB_TIMBDIER_CMP2IE		(1 << 1)
/** HRTIM_TIMB_TIMBDIER_CMP1IE CMP1IE **/
#define HRTIM_TIMB_TIMBDIER_CMP1IE		(1 << 0)

/**@}*/

