grevaillot/svd_tools/headers/STM32G474xx/hrtim_timb.h
#define HRTIM_TIMB_OUTBR_FAULT2_SHIFT		20
#define HRTIM_TIMB_OUTBR_FAULT2_MASK		0x03
/** @defgroup hrtim_timb_outbr_fault2 FAULT2 Output 2 Fault state
@{*/
/**@}*/

/** HRTIM_TIMB_OUTBR_IDLES2 Output 2 Idle State **/
#define HRTIM_TIMB_OUTBR_IDLES2		(1 << 19)
/** HRTIM_TIMB_OUTBR_IDLEM2 Output 2 Idle mode **/
#define HRTIM_TIMB_OUTBR_IDLEM2		(1 << 18)
/** HRTIM_TIMB_OUTBR_POL2 Output 2 polarity **/
#define HRTIM_TIMB_OUTBR_POL2		(1 << 17)
/** HRTIM_TIMB_OUTBR_BIAR Balanced Idle Automatic Resume **/
#define HRTIM_TIMB_OUTBR_BIAR		(1 << 14)

#define HRTIM_TIMB_OUTBR_DLYPRT_SHIFT		10
#define HRTIM_TIMB_OUTBR_DLYPRT_MASK		0x07
/** @defgroup hrtim_timb_outbr_dlyprt DLYPRT Delayed Protection
@{*/
/**@}*/

/** HRTIM_TIMB_OUTBR_DLYPRTEN Delayed Protection Enable **/
#define HRTIM_TIMB_OUTBR_DLYPRTEN		(1 << 9)
/** HRTIM_TIMB_OUTBR_DTEN Deadtime enable **/
#define HRTIM_TIMB_OUTBR_DTEN		(1 << 8)
/** HRTIM_TIMB_OUTBR_DIDL1 Output 1 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMB_OUTBR_DIDL1		(1 << 7)
/** HRTIM_TIMB_OUTBR_CHP1 Output 1 Chopper enable **/
#define HRTIM_TIMB_OUTBR_CHP1		(1 << 6)

#define HRTIM_TIMB_OUTBR_FAULT1_SHIFT		4
#define HRTIM_TIMB_OUTBR_FAULT1_MASK		0x03
/** @defgroup hrtim_timb_outbr_fault1 FAULT1 Output 1 Fault state
@{*/
/**@}*/

/** HRTIM_TIMB_OUTBR_IDLES1 Output 1 Idle State **/
#define HRTIM_TIMB_OUTBR_IDLES1		(1 << 3)
/** HRTIM_TIMB_OUTBR_IDLEM1 Output 1 Idle mode **/
#define HRTIM_TIMB_OUTBR_IDLEM1		(1 << 2)
/** HRTIM_TIMB_OUTBR_POL1 Output 1 polarity **/
#define HRTIM_TIMB_OUTBR_POL1		(1 << 1)

/**@}*/

/** @defgroup hrtim_timb_fltbr FLTBR Timerx Fault Register
@{*/

/** HRTIM_TIMB_FLTBR_FLTLCK Fault sources Lock **/
#define HRTIM_TIMB_FLTBR_FLTLCK		(1 << 31)
/** HRTIM_TIMB_FLTBR_FLT6EN Fault 6 enable **/
#define HRTIM_TIMB_FLTBR_FLT6EN		(1 << 5)
/** HRTIM_TIMB_FLTBR_FLT5EN Fault 5 enable **/
#define HRTIM_TIMB_FLTBR_FLT5EN		(1 << 4)
/** HRTIM_TIMB_FLTBR_FLT4EN Fault 4 enable **/
#define HRTIM_TIMB_FLTBR_FLT4EN		(1 << 3)
/** HRTIM_TIMB_FLTBR_FLT3EN Fault 3 enable **/
#define HRTIM_TIMB_FLTBR_FLT3EN		(1 << 2)
/** HRTIM_TIMB_FLTBR_FLT2EN Fault 2 enable **/
#define HRTIM_TIMB_FLTBR_FLT2EN		(1 << 1)
/** HRTIM_TIMB_FLTBR_FLT1EN Fault 1 enable **/
#define HRTIM_TIMB_FLTBR_FLT1EN		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_timbcr2 TIMBCR2 HRTIM Timerx Control Register 2
@{*/

/** HRTIM_TIMB_TIMBCR2_TRGHLF Triggered-half mode **/
#define HRTIM_TIMB_TIMBCR2_TRGHLF		(1 << 20)
/** HRTIM_TIMB_TIMBCR2_GTCMP3 Greater than Compare 3 PWM mode **/
#define HRTIM_TIMB_TIMBCR2_GTCMP3		(1 << 17)
/** HRTIM_TIMB_TIMBCR2_GTCMP1 Greater than Compare 1 PWM mode **/
#define HRTIM_TIMB_TIMBCR2_GTCMP1		(1 << 16)

#define HRTIM_TIMB_TIMBCR2_FEROM_SHIFT		14
#define HRTIM_TIMB_TIMBCR2_FEROM_MASK		0x03
/** @defgroup hrtim_timb_timbcr2_ferom FEROM Fault and Event Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMB_TIMBCR2_BMROM_SHIFT		12
#define HRTIM_TIMB_TIMBCR2_BMROM_MASK		0x03
/** @defgroup hrtim_timb_timbcr2_bmrom BMROM Burst Mode Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMB_TIMBCR2_ADROM_SHIFT		10
#define HRTIM_TIMB_TIMBCR2_ADROM_MASK		0x03
/** @defgroup hrtim_timb_timbcr2_adrom ADROM ADC Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMB_TIMBCR2_OUTROM_SHIFT		8
#define HRTIM_TIMB_TIMBCR2_OUTROM_MASK		0x03
/** @defgroup hrtim_timb_timbcr2_outrom OUTROM Output Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMB_TIMBCR2_ROM_SHIFT		6
#define HRTIM_TIMB_TIMBCR2_ROM_MASK		0x03
/** @defgroup hrtim_timb_timbcr2_rom ROM Roll-Over Mode
@{*/
/**@}*/

/** HRTIM_TIMB_TIMBCR2_UDM Up-Down Mode **/
#define HRTIM_TIMB_TIMBCR2_UDM		(1 << 4)
/** HRTIM_TIMB_TIMBCR2_DCDR Dual Channel DAC Reset trigger **/
#define HRTIM_TIMB_TIMBCR2_DCDR		(1 << 2)
/** HRTIM_TIMB_TIMBCR2_DCDS Dual Channel DAC Step trigger **/
#define HRTIM_TIMB_TIMBCR2_DCDS		(1 << 1)
/** HRTIM_TIMB_TIMBCR2_DCDE Dual Channel DAC trigger enable **/
#define HRTIM_TIMB_TIMBCR2_DCDE		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_beefr3 BEEFR3 HRTIM Timerx External Event Filtering Register 3
@{*/


#define HRTIM_TIMB_BEEFR3_EEVACNT_SHIFT		8
#define HRTIM_TIMB_BEEFR3_EEVACNT_MASK		0x3f
/** @defgroup hrtim_timb_beefr3_eevacnt EEVACNT External Event A counter
@{*/
/**@}*/


#define HRTIM_TIMB_BEEFR3_EEVASEL_SHIFT		4
#define HRTIM_TIMB_BEEFR3_EEVASEL_MASK		0x0f
/** @defgroup hrtim_timb_beefr3_eevasel EEVASEL External Event A Selection
@{*/
/**@}*/

/** HRTIM_TIMB_BEEFR3_EEVARSTM External Event A Reset Mode **/
#define HRTIM_TIMB_BEEFR3_EEVARSTM		(1 << 2)
/** HRTIM_TIMB_BEEFR3_EEVACRES External Event A Counter Reset **/
#define HRTIM_TIMB_BEEFR3_EEVACRES		(1 << 1)
/** HRTIM_TIMB_BEEFR3_EEVACE External Event A Counter Enable **/
#define HRTIM_TIMB_BEEFR3_EEVACE		(1 << 0)

/**@}*/
